app/controllers/admin_controller.rb

SELECT * FROM "page_types" WHERE ("page_types"."id" = 1)
SELECT * FROM "pages" WHERE ("pages"."id" = 6)
---
  def index
    pt = PageType.find(:all, :select => 'page_types.id, page_types.text')
    @page_type = Array.new

    tree = TreeCreator.new({:id => :id, :text=>:title,
        :include => [{:model => :page_type, :attributes => {:iconCls => :icon_cls } } ] })
    @pages = tree.create_tree Page.find(:all, :order => 'lft ASC' )