app/controllers/pages_controller.rb

SELECT * FROM "pages" ORDER BY lft ASC LIMIT 1
---
  def index
    if params[:id]
      @page = Page.find(params[:id])
    else
      @page = Page.first(:order => 'lft ASC')

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    #a = File.extname(path)
    render :json => Page.find(params[:id])